update readme diagram
